## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "terrateam-362405"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
!       cluster_ipv4_cidr           = "192.168.64.0/24" -> (known after apply)
+       datapath_provider           = (known after apply)
-       enable_autopilot            = false -> null
!       enable_intranode_visibility = false -> (known after apply)
-       enable_tpu                  = false -> null
!       endpoint                    = "35.224.67.182" -> (known after apply)
!       id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema" -> (known after apply)
-       initial_node_count          = 0 -> null
!       label_fingerprint           = "a9dc16a7" -> (known after apply)
!       master_version              = "1.24.3-gke.2100" -> (known after apply)
!       min_master_version          = "1.24.3-gke.2100" -> (known after apply)
        name                        = "cinema"
!       networking_mode             = "VPC_NATIVE" -> (known after apply)
!       node_version                = "1.24.3-gke.2100" -> (known after apply)
+       operation                   = (known after apply)
+       private_ipv6_google_access  = (known after apply)
-       resource_labels             = {} -> null
!       self_link                   = "https://container.googleapis.com/v1/projects/terrateam-362405/locations/us-central1/clusters/cinema" -> (known after apply)
!       services_ipv4_cidr          = "192.168.128.0/24" -> (known after apply)
!       subnetwork                  = "projects/terrateam-362405/regions/us-central1/subnetworks/production" -> "projects/terrateam-362405/regions/us-central1/subnetworks/production-01" # forces replacement
+       tpu_ipv4_cidr_block         = (known after apply)
        # (12 unchanged attributes hidden)

!       addons_config {
+           cloudrun_config {
+               disabled           = (known after apply)
+               load_balancer_type = (known after apply)
            }

!           gce_persistent_disk_csi_driver_config {
!               enabled = true -> (known after apply)
            }

            # (5 unchanged blocks hidden)
        }

+       authenticator_groups_config {
+           security_group = (known after apply)
        }

-       binary_authorization {
-           enabled = false -> null
        }

!       cluster_autoscaling {
            # (1 unchanged attribute hidden)

+           auto_provisioning_defaults {
+               boot_disk_kms_key = (known after apply)
+               image_type        = (known after apply)
+               oauth_scopes      = (known after apply)
+               service_account   = (known after apply)
            }
        }

+       confidential_nodes {
+           enabled = (known after apply)
        }

!       ip_allocation_policy {
!           cluster_ipv4_cidr_block       = "192.168.64.0/24" -> (known after apply)
!           services_ipv4_cidr_block      = "192.168.128.0/24" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

!       logging_config {
!           enable_components = [
-               "SYSTEM_COMPONENTS",
-               "WORKLOADS",
            ] -> (known after apply)
        }

!       maintenance_policy {
!           daily_maintenance_window {
!               duration   = "PT4H0M0S" -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

!       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
!           cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRR1JVeVlKTHd1UzRUSitUTFBZKzAyREFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSa04yRXpaVGc1TmkwNFltSTVMVFJsWVRNdFlXUmtOaTA0WkRKa05tSXhaak0yTUdZdwpJQmNOTWpJd09URTFNak14TWpJeVdoZ1BNakExTWpBNU1EZ3dNREV5TWpKYU1DOHhMVEFyQmdOVkJBTVRKR1EzCllUTmxPRGsyTFRoaVlqa3ROR1ZoTXkxaFpHUTJMVGhrTW1RMllqRm1Nell3WmpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQUo2WjNZMmVUMllKNkl2b2dWMk53R2hZekVYbkptZC9aWUZpQTZjNwpEMno3MlFoM2paSzhvaFkyeEsweEgvTWl0ZFV2U2s0MnhRY0UzTUthblBkaHh5ZUJWa21GWENyb2tPUGdIa2MzCnBKbU03T1FDTDgxR3FuTGJLUU1JYUJKMDF4Snd3MjZjNmFJVVBxSWp3dWlEam9mS1h5L1Zhc3MwU3VMb1ZmM3EKZ3BhdDRVOXJSUUJDbklnRUdRU0oxSUhiWWpVNHF3K05uUnFTaUx2eUpwcUsrTXRlb3FGemx0VzRPZDVSRko1ZApRcEVHM0pTMy8zTENMNHRIWkRzMFdsSlNHOUdMcGNSZ05OdXN5NE9KcDJDZ2xxbGZ6dWI0aWx6Yk5sVWZodkdRCmc2eFhEcytuZGpoTnpzNTYzVGZUV1RJbzN6Tis2d09HaWs2VzUxRUtwK3gyN3FEV0IrTGk2TlJpbGVZUm1PWjEKWUVEMXd0anUwc2ZpL0c5V1RHSi9TMW5LYVhRNVRtNlpsSjNnemk1dm1aNmhoMGdDZTRicWs4K2FNSEFDRWNLMQpweWU5YWEySWRyYXdaM0Z4Q1lFL2txWUdxZDRrTWVxM2NpSzRnOVh6dkJibnhjN0NBcUFHWlZVU1dycXJ6bEx4ClZORUN0WFVHTXhrWkZyMEYxRGxJYmgvc05RSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVUwWHIrOXN1WUtaZ2c1NzMzUmVza3dYMFRDbDR3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFDUGx4OVlUME5JVkwwOUtDU3VLN2FqN2MrWWZhT2VWMHc4UTJ2NjE3MEsrCnFzU1k0ekR3VUQzbFc1TXN0empnNFJlbE94bEdTcWw4ejZPOGhuVlFnYXY1LzUvY3VzZWNMaE5ianRPSGpxeHQKNngrT0JhMjZ3UlhGMzQ0ZExQWTJHdVkxMlp5ZE1kTGdhSWJHY1NZNkNvWkRHMTd5QnlpTlFxemlEeFRqK0k4RwpuL1Rkc0JWQVJ3V2tyRWVhOWd3SEJQcDdCSm5PbVJVMitCTVNja2l2YWVYdTBHTHJwT21Ickh5bEpHT0s2cGpwCmtFR2VrZG5Ka0NOSUczbEFIVmpxQ2l4ZStMa0ZCTStxVi9jN01Wb29TOFhIejUrRGU2ajgwc3hoSDhheVY1c0YKNGozQi9GdEVVK2tLVHdVYUVVQlcwRTYxQ0VDQ0hLM2QxeE1WK3BGU2pUb0s4Um9FVlBaRFNkeWo3Q3hQQ2lTOApuSjNBL1V6a3NETGdkbWxZVmYzY1c5a2pIQTJRaG5KL2dDT0tPdEZyekEya0NCTW4rblBBV0VpbkRNamh3NEU4CmpCaG9sTjQzTnA3eTB6cFM2eEhjcTlxWlFCZFdsblVDVWszUDQyNFh3d0dIT2R1K0lTdEI5NWdSOUJ3V3d0U2IKREpYaWpmVXZOQURzZWtmd3owMW1kUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

+       mesh_certificates {
+           enable_certificates = (known after apply)
        }

!       monitoring_config {
!           enable_components = [
-               "SYSTEM_COMPONENTS",
            ] -> (known after apply)
        }

!       network_policy {
-           provider = "PROVIDER_UNSPECIFIED" -> null
            # (1 unchanged attribute hidden)
        }

!       node_config {
+           boot_disk_kms_key = (known after apply)
!           disk_size_gb      = 100 -> (known after apply)
!           disk_type         = "pd-balanced" -> (known after apply)
!           guest_accelerator = [] -> (known after apply)
!           image_type        = "COS_CONTAINERD" -> (known after apply)
!           labels            = {} -> (known after apply)
!           local_ssd_count   = 0 -> (known after apply)
!           machine_type      = "e2-medium" -> (known after apply)
!           metadata          = {
-               "disable-legacy-endpoints" = "true"
            } -> (known after apply)
+           min_cpu_platform  = (known after apply)
+           node_group        = (known after apply)
!           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply)
!           preemptible       = false -> (known after apply)
!           service_account   = "terrateam@terrateam-362405.iam.gserviceaccount.com" -> (known after apply)
!           spot              = false -> (known after apply)
!           tags              = [
-               "gke-cinema",
-               "gke-cinema-default-pool",
            ] -> (known after apply)
!           taint             = [] -> (known after apply)

+           gcfs_config {
+               enabled = (known after apply)
            }

+           gvnic {
+               enabled = (known after apply)
            }

+           reservation_affinity {
+               consume_reservation_type = (known after apply)
+               key                      = (known after apply)
+               values                   = (known after apply)
            }

!           shielded_instance_config {
!               enable_integrity_monitoring = true -> (known after apply)
!               enable_secure_boot          = false -> (known after apply)
            }

!           workload_metadata_config {
!               mode = "GKE_METADATA" -> (known after apply)
            }
        }

!       node_pool {
!           instance_group_urls         = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-default-pool-9db48735-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-default-pool-39975e19-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroupManagers/gke-cinema-default-pool-76c36c53-grp",
            ] -> (known after apply)
!           managed_instance_group_urls = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-default-pool-9db48735-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-default-pool-39975e19-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroups/gke-cinema-default-pool-76c36c53-grp",
            ] -> (known after apply)
!           max_pods_per_node           = 110 -> (known after apply)
            name                        = "default-pool"
+           name_prefix                 = (known after apply)
!           node_count                  = 0 -> (known after apply)
!           node_locations              = [
-               "us-central1-a",
-               "us-central1-b",
-               "us-central1-c",
            ] -> (known after apply)
!           version                     = "1.24.3-gke.2100" -> (known after apply)
            # (1 unchanged attribute hidden)

!           management {
!               auto_repair  = true -> (known after apply)
!               auto_upgrade = true -> (known after apply)
            }

!           node_config {
!               disk_size_gb      = 100 -> (known after apply)
!               disk_type         = "pd-balanced" -> (known after apply)
!               guest_accelerator = [] -> (known after apply)
!               labels            = {} -> (known after apply)
!               local_ssd_count   = 0 -> (known after apply)
!               metadata          = {
-                   "disable-legacy-endpoints" = "true"
                } -> (known after apply)
+               min_cpu_platform  = (known after apply)
!               oauth_scopes      = [
-                   "https://www.googleapis.com/auth/logging.write",
-                   "https://www.googleapis.com/auth/monitoring",
                ] -> (known after apply)
                tags              = [
                    "gke-cinema",
                    "gke-cinema-default-pool",
                ]
!               taint             = [] -> (known after apply)
                # (5 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }

!           upgrade_settings {
!               max_surge       = 1 -> (known after apply)
!               max_unavailable = 0 -> (known after apply)
            }
        }

!       release_channel {
!           channel = "UNSPECIFIED" -> (known after apply)
        }

!       service_external_ips_config {
!           enabled = false -> (known after apply)
        }

        # (6 unchanged blocks hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 1
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
+           "us-central1-b",
+           "us-central1-c",
        ]
+       operation                   = (known after apply)
+       project                     = "terrateam-362405"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 3
+           min_node_count = 1
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 15
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 0
+           machine_type      = "e2-medium"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = false
+           service_account   = "terrateam@terrateam-362405.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.gke-cinema.random_shuffle.available_zones will be created
+   resource "random_shuffle" "available_zones" {
+       id           = (known after apply)
+       input        = (known after apply)
+       result       = (known after apply)
+       result_count = 3
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/production"] will be destroyed
  # (because key ["us-central1/production"] is not in for_each map)
-   resource "google_compute_subnetwork" "subnetwork" {
-       creation_timestamp         = "2022-09-15T16:41:06.976-07:00" -> null
-       gateway_address            = "10.10.10.1" -> null
-       id                         = "projects/terrateam-362405/regions/us-central1/subnetworks/production" -> null
-       ip_cidr_range              = "10.10.10.0/24" -> null
-       name                       = "production" -> null
-       network                    = "https://www.googleapis.com/compute/v1/projects/terrateam-362405/global/networks/cinema" -> null
-       private_ip_google_access   = false -> null
-       private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
-       project                    = "terrateam-362405" -> null
-       purpose                    = "PRIVATE" -> null
-       region                     = "us-central1" -> null
-       secondary_ip_range         = [
-           {
-               ip_cidr_range = "192.168.64.0/24"
-               range_name    = "us-central1-01-gke-01-pods"
            },
-           {
-               ip_cidr_range = "192.168.128.0/24"
-               range_name    = "us-central1-01-gke-01-services"
            },
        ] -> null
-       self_link                  = "https://www.googleapis.com/compute/v1/projects/terrateam-362405/regions/us-central1/subnetworks/production" -> null
-       stack_type                 = "IPV4_ONLY" -> null
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/production-01"] will be created
+   resource "google_compute_subnetwork" "subnetwork" {
+       creation_timestamp         = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       ip_cidr_range              = "10.1.0.0/16"
+       ipv6_cidr_range            = (known after apply)
+       name                       = "production-01"
+       network                    = "cinema"
+       private_ip_google_access   = false
+       private_ipv6_google_access = (known after apply)
+       project                    = "terrateam-362405"
+       purpose                    = (known after apply)
+       region                     = "us-central1"
+       secondary_ip_range         = [
+           {
+               ip_cidr_range = "192.1.0.0/16"
+               range_name    = "us-central1-01-gke-01-pods"
            },
+           {
+               ip_cidr_range = "192.2.0.0/20"
+               range_name    = "us-central1-01-gke-01-services"
            },
        ]
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
